---
kind: property
id: P:Autodesk.Revit.DB.HomeCamera.TopAngleOfFieldOfView
source: html/0d77148a-12e5-436a-aae5-d0f07eb4229e.htm
---
# Autodesk.Revit.DB.HomeCamera.TopAngleOfFieldOfView Property

The top angle of the field of view.

## Syntax (C#)
```csharp
public double TopAngleOfFieldOfView { get; }
```